# AddinFolder Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
DocumentEntryPoint..::..AddinFolder Property
DocumentEntryPoint Class See Also
---
The full path to the Revit Macros module.
**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public string AddinFolder { get; }
```

Visual Basic
---
```text
Public ReadOnly Property AddinFolder As String
	Get
```

Visual C++
---
```text
public:
virtual property String^ AddinFolder {
	String^ get () sealed;
}
```

# ### Implements
IEntryPoint..::..AddinFolder
# Remarks
This path should be used instead of the .NET GetExecutingAssembly() result, because the Macros module is loaded in such a way to make that result unreliable.
# See Also
DocumentEntryPoint Class
Autodesk.Revit.DB.Macros Namespace